In [1]:
import numpy as np
import pandas as pd

In [2]:
#merge two df based on column

employee=[(1,'name1'),(3,'name3'),(2,'name2')]

dept=[(2,'science','bbsr'),(1,'arts','angul'),(5,'eco','bari')]

df1=pd.DataFrame(employee,columns=['empid','name'])
df2=pd.DataFrame(dept,columns=['empid','course','location'])

df3=pd.merge(df1,df2,on='empid')

df3
#also works
#df1.merge(df2,on='empid')

   empid   name   course location
0      1  name1     arts    angul
1      2  name2  science     bbsr

In [ ]:
sample_data={'X':[78,85,96,80,86],'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

df=pd.DataFrame(sample_data)
df=df.loc[df['Y'].between(86,90)]
print(df)
for i,j in df.iterrows():
  print(i,'------',j['X'])

    X   Y   Z
2  96  89  96
4  86  86  83
2 ------ 96
4 ------ 86

In [ ]:
df['xy']=df['X']+df['Y']
df

    X   Y   Z   xy
0  78  84  86  162
1  85  94  97  179
2  96  89  96  185
3  80  83  72  163
4  86  86  83  172

**very imp**
**apply with lambda**

In [ ]:
df['y_score']=df['Y'].apply(lambda x:'low' if x>=70 and x<=90 else 'High')
df

    X   Y   Z high/low score_x y_score
0  78  84  86     keep    less     low
1  85  94  97     High    more    High
2  96  89  96     High    more     low
3  80  83  72     keep    less     low
4  86  86  83     keep    more     low

In [ ]:
df['high/low']='High'

#df['high/low'][df['Z'].between(70,90)]='Keep'. #error/not suggested

rows=df.loc[:,'Z'].between(70,90)
print(rows)
df.loc[rows,'high/low']='keep'
df

0     True
1    False
2    False
3     True
4     True
Name: Z, dtype: bool

    X   Y   Z high/low
0  78  84  86     keep
1  85  94  97     High
2  96  89  96     High
3  80  83  72     keep
4  86  86  83     keep

In [ ]:
#create a column called 'score_x' which value will be more/less ,if inbetween 70-80 then less

df['score_x']=df['X'].apply(lambda a: 'less' if a>=70 and a<=90 else 'more')
df

    X   Y   Z high/low score_x y_score
0  78  84  86     keep    less     low
1  85  94  97     High    less    High
2  96  89  96     High    more     low
3  80  83  72     keep    less     low
4  86  86  83     keep    less     low

In [ ]:
#with index lebel
exam_data={'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
           'attempts':[1,3,2,3,2,3,1,1,2,1],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes']}
lebels=list('abcdefghij') 

df=pd.DataFrame(exam_data,index=lebels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
#3-summary of basic info about the df and its data

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 720.0+ bytes

In [ ]:
#4-get first 3 rows

df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [ ]:
#5-select name,score from dataframe


#df[['name','score']]
df.loc[:,['name','score']]
#df.loc['a':'c',['name','score']]
#df.iloc[:,0:2]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [ ]:
#6-select name,score column for rows 1,3,5,6 from dataframe
df.iloc[[1,3,5,6],[0,1]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [ ]:
#7-attempts greater than 2

df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [ ]:
#8-count no of cols and rows in a dataframe

print(len(df.index))
print(len(df.columns))

print('No of columns in dataframe:',len(df.axes[1]))
print('No of rows in dataframe:', len(df.axes[0]))

10
4
No of columns in dataframe: 4
No of rows in dataframe: 10

In [ ]:
#9-rows where score is missing i.e NaN

df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [ ]:
#10-rows where score in bet 15 to 20

print(df[df['score'].between(15,20)])

print()

#print(df[(df['score']>=15) & (df['score']<=20)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [ ]:
#11-rows where attempts less than 2 and score>15

df[(df['score']>15) & (df['attempts']<2)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [ ]:
#12-change score in row 'd' to 11.5

df.loc['d','score']=11.5

#df.loc['d',:]
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [ ]:
#13-sum of exam attempts by students

df['attempts'].sum()

19

In [ ]:
#14-cal mean score for each diff student in dataframe

df['score'].mean()

df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

**new row with index name**

In [ ]:
#15-append a new row 'k' to df with given values for each col.Now delete the new row and return the original df
#name=suresh,score=15.5, attempts=1,qualify='yes,lebel=k

df.loc['k']=['suresh',15.5,1,'yes']
print(df)

df.drop(['k','ki'],inplace=True)
df

         name  score  attempts qualify
a   Anastasia   12.5         1     yes
b        Dima    9.0         3      no
c   Katherine   16.5         2     yes
d       James   11.5         3      no
e       Emily    9.0         2      no
f     Michael   20.0         3     yes
g     Matthew   14.5         1     yes
h       Laura    NaN         1      no
i       Kevin    8.0         2      no
j       Jonas   19.0         1     yes
ki       ABCS   15.5         1     yes
k      suresh   15.5         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

**sort_values**

In [ ]:
#16-sort df by name in descending order,then by score in ascending order

df.sort_values(by=['name','score'],ascending=[False,True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

**Map**

In [ ]:
#17-replace qualify col values(yes,no) to True /False
df['qualify']=df['qualify'].map({'yes':True,'no':False})

df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

**Replace**

In [ ]:
#18-change james to suresh

#df['name'][df['name']=='James']='Suresh'

df['name']=df['name'].replace('James',"Suresh")
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

**drop/pop**

In [ ]:
#19-delete attempts col

df.drop(['attempts'],axis=1,inplace=True)
df.pop('qualify')
df

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d     Suresh   11.5
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [ ]:
#20-insert a new column in the df

# exam_data={'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
#            'attempts':[1,3,2,3,2,3,1,1,2,1],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes']}
# lebels=list('abcdefghij') 

# df=pd.DataFrame(exam_data,index=lebels)

df['colors']=['Red','Green','Yellow','Red','White','Black','Pink','Orange','Yellow','Orange']
df

        name  score  attempts qualify  colors
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no   Green
c  Katherine   16.5         2     yes  Yellow
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   Black
g    Matthew   14.5         1     yes    Pink
h      Laura    NaN         1      no  Orange
i      Kevin    8.0         2      no  Yellow
j      Jonas   19.0         1     yes  Orange

In [ ]:
#21-list of column headers

#print((df.columns))
print(list(df.columns))

Index(['name', 'score', 'attempts', 'qualify', 'colors'], dtype='object')
['name', 'score', 'attempts', 'qualify', 'colors']

**iterrows()**

In [ ]:
#22-iterate over rows

for index,row in df.iterrows():
  print(row['name'],index)

Anastasia a
Dima b
Katherine c
James d
Emily e
Michael f
Matthew g
Laura h
Kevin i
Jonas j

**rename**

In [ ]:
import pandas as pd
#23-rename columns of a df

#original df--  col1 col2 col3
              # 0 1      4    7
              # 1 5      4    8
              # 2 8      2    1
              # 3 3      5    4

#Expected df--  column 1 column 2 column 3
              # 0   1           4    7
              # 1   5           4    8
              # 2   8           2    1
              # 3   3           5    4


data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)
print(df1)

df1=df1.rename(columns={'col1':'column1','col2':'column2','col3':'column3'})
print()

print(df1)

   col1  col2  col3
0     1     4     7
1     5     4     8
2     5     2     1
3     3     5     4

   column1  column2  column3
0        1        4        7
1        5        4        8
2        5        2        1
3        3        5        4

In [ ]:
#24-rows fro column1 value==5

df1[df1['column1']==5]

   column1  column2  column3
1        5        4        8
2        5        2        1

**sort_index(axis=1,ascending=False)**

In [ ]:
#25-change order of df1(column1,column2,column3) to column3,column2,column1

print(df1.sort_index(axis=1,ascending=False))

print()

print(df1.sort_index(axis=0,ascending=False))

   column3  column2  column1
0        7        4        1
1        8        4        5
2        1        2        5
3        4        5        3

   column1  column2  column3
3        3        5        4
2        5        2        1
1        5        4        8
0        1        4        7

**add new row by loc / len(df.index)**

In [ ]:
#26-add one more row to df1

print(len(df1.index))
df1.loc[len(df1.index)]=[3,6,9]
#df1.drop(5)


#append

df2={'column1':4,'column2':8,'column3':12}

df1=df1.append(df2,ignore_index=True)
df1

4

   column1  column2  column3
0        1        4        7
1        5        4        8
2        5        2        1
3        3        5        4
4        3        6        9
5        4        8       12

In [ ]:
#27-save df1 into csv using tab separator

df1.to_csv('df1.csv',sep='\t',index=False)

**groupby**

In [ ]:
#28-display no of people according to city
# city   no of people

data={'name':['gyana','nanda','chandan','swaraj','swadhin','balaram','bighna','aneesh','chandu','surya','tabu','pati','shiba'],
      'city':['angul','jagatsinghpur','jharsuguda','angul','angul','puri','angul','sambalpur','baripada','jajpur','jharsuguda','jajpur','baripada']}

df2=pd.DataFrame(data) 

print(pd.unique(df2['city']))

print(df2.groupby (['city']) )

print(df2.groupby (['city']).size() )

print(df2.groupby (['city']).size() )

print('-------------------------------------------------')

print(df2.groupby (['city']).size().reset_index(name='No of people') )

['angul' 'jagatsinghpur' 'jharsuguda' 'puri' 'sambalpur' 'baripada'
 'jajpur']
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fada32716d0>
city
angul            4
baripada         2
jagatsinghpur    1
jajpur           2
jharsuguda       2
puri             1
sambalpur        1
dtype: int64
city
angul            4
baripada         2
jagatsinghpur    1
jajpur           2
jharsuguda       2
puri             1
sambalpur        1
dtype: int64
-------------------------------------------------
            city  No of people
0          angul             4
1       baripada             2
2  jagatsinghpur             1
3         jajpur             2
4     jharsuguda             2
5           puri             1
6      sambalpur             1

In [ ]:
#29-delete df rows based on a given column value 

data29={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,4,4]}

df29=pd.DataFrame(data29)
print(df29)

print(df29[df29['col3']==4].index)

df29.drop(df29[df29['col3']==4].index,axis=0,inplace=True)

df29

   col1  col2  col3
0     1     4     7
1     5     4     8
2     5     2     4
3     3     5     4
Int64Index([2, 3], dtype='int64')

   col1  col2  col3
0     1     4     7
1     5     4     8

In [ ]:
#31-select a row of series/df by given integer index

data31={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,4,4]}

df31=pd.DataFrame(data31)
print(df31.iloc[2,:])

print()

print(df31.iloc[[2]])

col1    5
col2    2
col3    4
Name: 2, dtype: int64

   col1  col2  col3
2     5     2     4

In [ ]:
#32-replace all nan with zeros in a column of a df
import numpy as np
exam_data32={'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
         'attempts':[1,3,2,3,2,3,1,1,2,1],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes']}

df32=pd.DataFrame(exam_data32)   

df32['score'].fillna(0,inplace=True)
df32

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [ ]:
#33-covert index in a column of the given df
#index as column
print('original')
print(df32)

print('index in column')
df32.reset_index(inplace=True)
print(df32)

#hiding index
print('hiding index')
print(df32.to_string(index=False))

original
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    0.0         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    0.0         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes
index in column
   level_0  index       name  score  attempts qualify
0        0      0  Anastasia   12.5         1     yes
1        1      1       Dima    9.0         3      no
2        2      2  Katherine   16.5         2     yes
3        3      3      James    0.0         3      no
4        4      4      Emily    9.0         2      no
5        5      5    Michael   20.0         3     yes
6        6      6    Matthew   14.5         1     yes
7        7      7      Laura    0.0         1      no
8        8      8      Kevin    8.0         2      no
9        9      9      Jonas   19.0         1     yes
hiding index
 level_0  index       name  score  attempts qualify
       0      0  Anastasia   12.5         1     yes
       1      1       Dima    9.0         3      no
       2      2  Katherine   16.5         2     yes
       3      3      James    0.0         3      no
       4      4      Emily    9.0         2      no
       5      5    Michael   20.0         3     yes
       6      6    Matthew   14.5         1     yes
       7      7      Laura    0.0         1      no
       8      8      Kevin    8.0         2      no
       9      9      Jonas   19.0         1     yes

**df.at[], df.replace**

In [ ]:
#34-change a PARTICULAR CELL VALUE
#change score of Emily to 90
exam_data34={'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
         'attempts':[1,3,2,3,2,3,1,1,2,1],'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes']}

df34=pd.DataFrame(exam_data34)   
df34.at[4,'score']=90

print(df34)
#replace score value nan to -100
df34['score']=df34['score'].replace(np.nan,-100)
df34

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily   90.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James -100.0         3      no
4      Emily   90.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura -100.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [ ]:
#35-count nan values in one or more cols in df
exam_data35={'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
         'attempts':[1,3,2,3,2,np.nan,1,1,2,1],'qualify':['yes','no','yes','no','no',np.nan,'yes','no','no','yes']}

df35=pd.DataFrame(exam_data35) 
print(len(df35[df35.isnull().any(axis=1)].index)) #incorrect
print(df35.isnull().sum())
df35.isnull().values.sum() #correct

3
name        0
score       2
attempts    1
qualify     1
dtype: int64

4

In [ ]:
#36-drop a list of rows from a df (remove 3,5th rows)
exam_data36={'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
         'attempts':[1,3,2,3,2,np.nan,1,1,2,1],'qualify':['yes','no','yes','no','no',np.nan,'yes','no','no','yes']}

df36=pd.DataFrame(exam_data36) 

print(df36.drop([2,4]))
df36.drop(df36.index[[3,5]])

        name  score  attempts qualify
0  Anastasia   12.5       1.0     yes
1       Dima    9.0       3.0      no
3      James    NaN       3.0      no
5    Michael   20.0       NaN     NaN
6    Matthew   14.5       1.0     yes
7      Laura    NaN       1.0      no
8      Kevin    8.0       2.0      no
9      Jonas   19.0       1.0     yes

        name  score  attempts qualify
0  Anastasia   12.5       1.0     yes
1       Dima    9.0       3.0      no
2  Katherine   16.5       2.0     yes
4      Emily    9.0       2.0      no
6    Matthew   14.5       1.0     yes
7      Laura    NaN       1.0      no
8      Kevin    8.0       2.0      no
9      Jonas   19.0       1.0     yes

In [ ]:
#37-rest_index after removing rows

In [ ]:
#38-divide a df in a given ratio

**pd.concat([],axis=)**

In [ ]:
#39-combining two series into a DataFrame

s1=pd.Series([1,2,3,4,5],dtype='int64')
s2=pd.Series([55,44,33,22,11],dtype=float)

print(s1)
print(s2)
print(s1+s2)

#combine rowwise
df=pd.concat([s1,s2])
print(df)

#combine columnwise
df=pd.concat([s1,s2],axis=1)
print(df)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    55.0
1    44.0
2    33.0
3    22.0
4    11.0
dtype: float64
0    56.0
1    46.0
2    36.0
3    26.0
4    16.0
dtype: float64
0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
0    55.0
1    44.0
2    33.0
3    22.0
4    11.0
dtype: float64
   0     1
0  1  55.0
1  2  44.0
2  3  33.0
3  4  22.0
4  5  11.0

**df.sample**

In [ ]:
#40-shuffle data in a df
exam_data40={'name':['Anastasia','Dima','Katherine','James','Emily','Michael','Matthew','Laura','Kevin','Jonas'],'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
         'attempts':[1,3,2,3,2,np.nan,1,1,2,1],'qualify':['yes','no','yes','no','no',np.nan,'yes','no','no','yes']}

df40=pd.DataFrame(exam_data40) 

print('original')
print(df40)

print('after shuffle')
df40=df40.sample(frac=1)
print(df40)

original
        name  score  attempts qualify
0  Anastasia   12.5       1.0     yes
1       Dima    9.0       3.0      no
2  Katherine   16.5       2.0     yes
3      James    NaN       3.0      no
4      Emily    9.0       2.0      no
5    Michael   20.0       NaN     NaN
6    Matthew   14.5       1.0     yes
7      Laura    NaN       1.0      no
8      Kevin    8.0       2.0      no
9      Jonas   19.0       1.0     yes
after shuffle
        name  score  attempts qualify
7      Laura    NaN       1.0      no
1       Dima    9.0       3.0      no
6    Matthew   14.5       1.0     yes
9      Jonas   19.0       1.0     yes
0  Anastasia   12.5       1.0     yes
2  Katherine   16.5       2.0     yes
8      Kevin    8.0       2.0      no
5    Michael   20.0       NaN     NaN
4      Emily    9.0       2.0      no
3      James    NaN       3.0      no

**date format: to_datetime**

In [ ]:
#41-string date to formatted date
import pandas as pd

data={'date_col':['06152021','06162021','06172021','06182021','06192021']}
df=pd.DataFrame(data)

df.to_csv('date.csv')

df1=pd.read_csv('date.csv')
df1['date_col']=pd.to_datetime(df1['date_col'],format='%m%d%Y')
df1['date_col']

0   2021-06-15
1   2021-06-16
2   2021-06-17
3   2021-06-18
4   2021-06-19
Name: date_col, dtype: datetime64[ns]

In [ ]:
#42-rename a column
data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)
print(df1)

df1=df1.rename(columns={'col2':'column_2'})
df1

   col1  col2  col3
0     1     4     7
1     5     4     8
2     5     2     1
3     3     5     4

   col1  column_2  col3
0     1         4     7
1     5         4     8
2     5         2     1
3     3         5     4

**df.tolist()**

In [ ]:
#43-get the values of a specia=fic column in a list

data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)
print(df1)

df1['col2'].tolist()

   col1  col2  col3
0     1     4     7
1     5     4     8
2     5     2     1
3     3     5     4

[4, 4, 2, 5]

In [ ]:
#44-create a DataFrame from a Numpy array and specify the index column and column headers

arr=np.zeros(10,dtype={'names':['col1','col2','col3'],'formats':['i8',float,'i8']})
print(arr)

#convert
index=['index'+str(i) for i in range(1,len(arr)+1)]
df=pd.DataFrame(arr,index=index)
df

[(0, 0., 0) (0, 0., 0) (0, 0., 0) (0, 0., 0) (0, 0., 0) (0, 0., 0)
 (0, 0., 0) (0, 0., 0) (0, 0., 0) (0, 0., 0)]

         col1  col2  col3
index1      0   0.0     0
index2      0   0.0     0
index3      0   0.0     0
index4      0   0.0     0
index5      0   0.0     0
index6      0   0.0     0
index7      0   0.0     0
index8      0   0.0     0
index9      0   0.0     0
index10     0   0.0     0

**argmax**

In [ ]:
#45-find the row for where the value of a given column is maximum

data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)
print(df1)
print('')
print("Row data where col2 has maximum value:")

print(df1[ df1['col2']==df1['col2'].max() ])

print("Row number where col1 has maximum value:")
print(df1['col1'].argmax())

   col1  col2  col3
0     1     4     7
1     5     4     8
2     5     2     1
3     3     5     4

Row where col2 has maximum value:
   col1  col2  col3
3     3     5     4
Row where col1 has maximum value:
1

In [ ]:
#46-check whether a given column is present in a DataFrame or not.

if col_name in df.columns #df.columns returns a list of columns

In [ ]:
#47-get the specified row value of a given DataFrame
data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)
print(df1)
print('row 2')
df1.loc[1]. #df1.iloc[1]

   col1  col2  col3
0     1     4     7
1     5     4     8
2     5     2     1
3     3     5     4
row 2

col1    5
col2    4
col3    8
Name: 1, dtype: int64

In [ ]:
#48-get data tyoes of columns
arr=np.zeros(10,dtype={'names':['col1','col2','col3'],'formats':['i8',float,'i8']})


#convert
index=['index'+str(i) for i in range(1,len(arr)+1)]
df=pd.DataFrame(arr,index=index)

df.dtypes

col1      int64
col2    float64
col3      int64
dtype: object

In [ ]:
#49-append data to an empty DataFrame

df=pd.DataFrame()
print('original:',df)

data={'name':['gyana','nanda','chandan','motu'],'exp':[6,8,7,5]}

#append
print(df.append(data,ignore_index=True))

#append as df

df2=pd.DataFrame(data)
df.append(df2,ignore_index=True)

original: Empty DataFrame
Columns: []
Index: []
            exp                           name
0  [6, 8, 7, 5]  [gyana, nanda, chandan, motu]

      name  exp
0    gyana    6
1    nanda    8
2  chandan    7
3     motu    5

In [ ]:
#50-sort a given DataFrame by two or more columns

data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)

df1.sort_values(by=['col2','col1'],ascending=[True,False])

   col1  col2  col3
2     5     2     1
1     5     4     8
0     1     4     7
3     3     5     4

**df.astype()**

In [ ]:
#51-convert the datatype of a given column (int to floats)

data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)
#df1['col2'].dtypes=float #error

df1['col2'].astype(float)

0    4.0
1    4.0
2    2.0
3    5.0
Name: col2, dtype: float64

In [ ]:
#52-replace infinite values with NaN

df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df)
print("Removing infinite values:")
df = df.replace([np.inf, -np.inf], np.nan)
print(df)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
Removing infinite values:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

**IMP**

In [ ]:
#53-insert a given column at a specific column index in a DataFrame.new_column at position 2

data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)

df1.insert(loc=1,column='new_column',value=[0,0,0,0])
df1

   col1  new_column  col2  col3
0     1           0     4     7
1     5           0     4     8
2     5           0     2     1
3     3           0     5     4

In [ ]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Mary', 'Ricky'],'Age':[28,34,29,42],'Gender':['M','M','F','F']}
df = pd.DataFrame(data)
print(df)
top_row = pd.DataFrame({'Name':['Lavina'],'Age':[2],'Gender':['F']})
# Concat with old DataFrame and reset the Index.
df = pd.concat([top_row, df]).reset_index(drop = True)
#df=pd.concat([top_row,df],ignore_index=True)
print()
print(df)

    Name  Age Gender
0    Tom   28      M
1   Jack   34      M
2   Mary   29      F
3  Ricky   42      F

     Name  Age Gender
0  Lavina    2      F
1     Tom   28      M
2    Jack   34      M
3    Mary   29      F
4   Ricky   42      F

**insert a row at a given position**

In [ ]:

data = {'Name':['Tom', 'Jack', 'Mary', 'Ricky'],'Age':[28,34,29,42],'Gender':['M','M','F','F']}
df = pd.DataFrame(data)
print(df)
row = pd.DataFrame({'Name':['Lavina'],'Age':[2],'Gender':['F']},index=[2.5])
df=df.append(row,ignore_index=False)
print()
print(df)
df.sort_index().reset_index(drop=True)

    Name  Age Gender
0    Tom   28      M
1   Jack   34      M
2   Mary   29      F
3  Ricky   42      F

       Name  Age Gender
0.0     Tom   28      M
1.0    Jack   34      M
2.0    Mary   29      F
3.0   Ricky   42      F
2.5  Lavina    2      F

     Name  Age Gender
0     Tom   28      M
1    Jack   34      M
2    Mary   29      F
3  Lavina    2      F
4   Ricky   42      F

**Binning in Pandas with Age Example**

In [ ]:
df = pd.DataFrame({'age': np.random.randint(21, 51, 8)})

#Create New Column of age_bins Via Defining Bin Edges
df['age_bins']=pd.cut(x=df['age'],bins=[20, 29, 39, 49])
print(df)
print(df['age_bins'].unique())

   age  age_bins
0   45  (39, 49]
1   26  (20, 29]
2   27  (20, 29]
3   28  (20, 29]
4   30  (29, 39]
5   23  (20, 29]
6   22  (20, 29]
7   31  (29, 39]
[(39, 49], (20, 29], (29, 39]]
Categories (3, interval[int64]): [(20, 29] < (29, 39] < (39, 49]]

In [ ]:
#Create New Column of of age_by_decade With Labels 20s, 30s, and 40s
df['age_by_decade']=pd.cut(x=df['age'],bins=[20, 29, 39, 49],labels=['20s', '30s', '40s'])
df

   age  age_bins age_by_decade
0   45  (39, 49]           40s
1   26  (20, 29]           20s
2   27  (20, 29]           20s
3   28  (20, 29]           20s
4   30  (29, 39]           30s
5   23  (20, 29]           20s
6   22  (20, 29]           20s
7   31  (29, 39]           30s

**apply**

In [ ]:
data={'col1':[1,5,5,3],'col2':[4,4,2,5],'col3':[7,8,1,4]}

df1=pd.DataFrame(data)
print(df1)
print('first row')
print(df1.apply(lambda x:x[0]) )#first row
print('first column')
print(df1.apply(lambda x:x[0],axis=1))
print('access by column name')
print(df1.apply(lambda x:x['col2'],axis=1))

   col1  col2  col3
0     1     4     7
1     5     4     8
2     5     2     1
3     3     5     4
first row
col1    1
col2    4
col3    7
dtype: int64
first column
0    1
1    5
2    5
3    3
dtype: int64
access by column name
0    4
1    4
2    2
3    5
dtype: int64

# IMP

In [2]:
import pandas as pd

In [1]:
data={'crncy':['abc','xyz','abc','pqe','abc'],'name':['gyana','sura','mitu','gybali','gybighna'],'stock':[100,200,300,400,500],'trade':[10,20,30,40,50]

     
     }

In [3]:
df=pd.DataFrame(data)
df

  crncy      name  stock  trade
0   abc     gyana    100     10
1   xyz      sura    200     20
2   abc      mitu    300     30
3   pqe    gybali    400     40
4   abc  gybighna    500     50

In [4]:
#stock=stock/10 if crncy=abc and name starts with 'gy'

In [5]:
df['stock']=df.apply(lambda x:x['stock']/10 if(x['crncy']=='abc' and x['name'].startswith("gy")) else x['stock'] 
                     , axis=1)

In [6]:
df

  crncy      name  stock  trade
0   abc     gyana   10.0     10
1   xyz      sura  200.0     20
2   abc      mitu  300.0     30
3   pqe    gybali  400.0     40
4   abc  gybighna   50.0     50

In [7]:
#alternate way

In [9]:
def test(crncy,name,stock):
    if crncy=='abc' and name.startswith('gy'):
        stock=stock/10
    return stock    



df['stock']=df.apply(lambda x:test(x['crncy'],x['name'],x['stock']) , axis=1)

In [10]:
df

  crncy      name  stock  trade
0   abc     gyana    1.0     10
1   xyz      sura  200.0     20
2   abc      mitu  300.0     30
3   pqe    gybali  400.0     40
4   abc  gybighna    5.0     50

In [ ]:
l=str(input('enter the line: '))
l1=l.split(' ')
print(l1[::-1])
print(' '.join(l1[::-1]))

enter the line: hello world
['world', 'hello']
worldhello
world hello

In [ ]:
def funct(f):
  def inner(*args):
    a=args[0]
    b=args[1]
    if a<b:
      print('inside')
      a,b=b,a
    result=f(a,b)  
    return result
  return inner   

@funct
def divideR(a,b):
  return a/b

print(divideR(4,16)  )

inside
4.0